app/Controllers/Orang.php

SELECT *
FROM `orang`
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `orang`
---
    public function index()
    {
        $currentPage = $this->request->getVar('page_orang') ? $this->request->getVar('page_orang') : 1;

        // Cari nama berdasarkan keyword
        $keyword = $this->request->getVar('keyword');

        // cek jika ada keyword
        if($keyword) {

            // jika ada, maka panggil method search didalam model
           $orang = $this->orangModel->search($keyword);

        }else{

            //jika tidak ada keyword pencarian, maka tampilkan semua data
            $orang = $this->orangModel;
        }

        $data = [

            'title' => 'Daftar Orang',
            // 'orang' => $this->orangModel->findAll()

            // paginate untuk menentukan berapa data yang akan tampil di setiap halamannya
            'orang' => $orang->paginate(5, 'orang'),